# Pandas
https://pandas.pydata.org/

In [1]:
import pandas as pd

In [4]:
tab = pd.read_csv('persone.csv', delimiter=',')
tab

        nome    cognome  peso  altezza data_nascita sesso
0      Marco      Rossi  75.5      178   1990-01-15     M
1       Anna      Verdi  62.0      165   1995-03-20     F
2       Luca    Bianchi  80.0      182   1988-11-05     M
3      Sofia       Neri  58.0      160   1997-07-12     F
4     Davide     Gialli  72.0      175   1992-04-25     M
5       Sara       Rosa  60.0      163   1998-09-08     F
6     Andrea    Azzurri  78.0      180   1991-06-10     M
7     Chiara      Viola  55.0      158   1999-12-22     F
8     Matteo    Marroni  85.0      185   1987-02-18     M
9  Valentina  Arancioni  63.0      167   1994-05-15     F

In [5]:
tab2 = tab[['cognome', 'nome']]
tab2

     cognome       nome
0      Rossi      Marco
1      Verdi       Anna
2    Bianchi       Luca
3       Neri      Sofia
4     Gialli     Davide
5       Rosa       Sara
6    Azzurri     Andrea
7      Viola     Chiara
8    Marroni     Matteo
9  Arancioni  Valentina

In [6]:
tab3 = tab2.sort_values(by='cognome')
tab3

     cognome       nome
9  Arancioni  Valentina
6    Azzurri     Andrea
2    Bianchi       Luca
4     Gialli     Davide
8    Marroni     Matteo
3       Neri      Sofia
5       Rosa       Sara
0      Rossi      Marco
1      Verdi       Anna
7      Viola     Chiara

In [7]:
tab.head()

     nome  cognome  peso  altezza data_nascita sesso
0   Marco    Rossi  75.5      178   1990-01-15     M
1    Anna    Verdi  62.0      165   1995-03-20     F
2    Luca  Bianchi  80.0      182   1988-11-05     M
3   Sofia     Neri  58.0      160   1997-07-12     F
4  Davide   Gialli  72.0      175   1992-04-25     M

In [8]:
tab4 = tab.sort_values(by='cognome')
tab4.head()

        nome    cognome  peso  altezza data_nascita sesso
9  Valentina  Arancioni  63.0      167   1994-05-15     F
6     Andrea    Azzurri  78.0      180   1991-06-10     M
2       Luca    Bianchi  80.0      182   1988-11-05     M
4     Davide     Gialli  72.0      175   1992-04-25     M
8     Matteo    Marroni  85.0      185   1987-02-18     M

In [10]:
#accedo usando l'indice/chiave della riga
print(tab4.loc[6])

nome                Andrea
cognome            Azzurri
peso                  78.0
altezza                180
data_nascita    1991-06-10
sesso                    M
Name: 6, dtype: object

In [11]:
#accedo per posizione di riga / numero di riga
print(tab4.iloc[0])

nome             Valentina
cognome          Arancioni
peso                  63.0
altezza                167
data_nascita    1994-05-15
sesso                    F
Name: 9, dtype: object

Con loc e iloc posso usare lo slicing

In [12]:
tab5 = tab4.iloc[0:3]
tab5

        nome    cognome  peso  altezza data_nascita sesso
9  Valentina  Arancioni  63.0      167   1994-05-15     F
6     Andrea    Azzurri  78.0      180   1991-06-10     M
2       Luca    Bianchi  80.0      182   1988-11-05     M

In [15]:
tab6 = tab4.loc[range(0,4)]
tab6

    nome  cognome  peso  altezza data_nascita sesso
0  Marco    Rossi  75.5      178   1990-01-15     M
1   Anna    Verdi  62.0      165   1995-03-20     F
2   Luca  Bianchi  80.0      182   1988-11-05     M
3  Sofia     Neri  58.0      160   1997-07-12     F

## selezioni

In [16]:
tab[tab.sesso == 'F']

        nome    cognome  peso  altezza data_nascita sesso
1       Anna      Verdi  62.0      165   1995-03-20     F
3      Sofia       Neri  58.0      160   1997-07-12     F
5       Sara       Rosa  60.0      163   1998-09-08     F
7     Chiara      Viola  55.0      158   1999-12-22     F
9  Valentina  Arancioni  63.0      167   1994-05-15     F

In [17]:
tab[(tab.altezza > 1.70) & (tab.peso > 70)]

     nome  cognome  peso  altezza data_nascita sesso
0   Marco    Rossi  75.5      178   1990-01-15     M
2    Luca  Bianchi  80.0      182   1988-11-05     M
4  Davide   Gialli  72.0      175   1992-04-25     M
6  Andrea  Azzurri  78.0      180   1991-06-10     M
8  Matteo  Marroni  85.0      185   1987-02-18     M

# Manipolare dati, righe e colonne

creo una tabella "al volo"

In [20]:
#creo le colonne con i dati
fruit = pd.Series(index=[1,2,3,9], data=['mele', 'pere', 'kiwi', 'banane'])
magazzino = pd.Series(index=[1,2,3,9], data=[10,20,30,40])
#combino le colonne in un dataframe
shop = pd.DataFrame({'frutta':fruit, 'qta':magazzino})
shop

   frutta  qta
1    mele   10
2    pere   20
3    kiwi   30
9  banane   40

modifico una riga accedendo con la chiave (loc)

In [21]:
shop.loc[9] = ['banane', 100]
shop

   frutta  qta
1    mele   10
2    pere   20
3    kiwi   30
9  banane  100

Se specifico una riga con indice "inesistente", la riga è aggiunta alla tabella

In [23]:
shop.loc[20] = ['pomodori', 123]
shop

      frutta  qta
1       mele   10
2       pere   20
3       kiwi   30
9     banane  100
20  pomodori  123

Cancello una riga

In [25]:
shop2 = shop.drop(20)
shop2

   frutta  qta
1    mele   10
2    pere   20
3    kiwi   30
9  banane  100

elenco degli indici di una tabella

In [26]:
shop.index

Index([1, 2, 3, 9, 20], dtype='int64')

Ricavo l'ultimo indice

In [28]:
shop.index[-1]

20

Cancello l'ultima riga

In [29]:
shop3 = shop.drop(shop.index[-1])
shop3

   frutta  qta
1    mele   10
2    pere   20
3    kiwi   30
9  banane  100

Cancellare una colonna

In [30]:
shop4 = shop.drop('qta', axis=1)
shop4

      frutta
1       mele
2       pere
3       kiwi
9     banane
20  pomodori

# concateno tabelle

In [34]:
#creo le colonne con i dati
fruit2 = pd.Series(index=[10,20,30,90], data=['patate', 'sedano', 'zucche', 'cipolle'])
magazzino2 = pd.Series(index=[10,20,30,90], data=[10,20,30,40])
price2 = pd.Series(index=[10,20,30,90], data=[1,2,3,4])
#combino le colonne in un dataframe
orto = pd.DataFrame({'frutta':fruit2, 'qta':magazzino2, 'prz':price2})
orto

     frutta  qta  prz
10   patate   10    1
20   sedano   20    2
30   zucche   30    3
90  cipolle   40    4

In [35]:
glob = pd.concat([shop, orto]).reset_index(drop=True)
glob

     frutta  qta  prz
0      mele   10  NaN
1      pere   20  NaN
2      kiwi   30  NaN
3    banane  100  NaN
4  pomodori  123  NaN
5    patate   10  1.0
6    sedano   20  2.0
7    zucche   30  3.0
8   cipolle   40  4.0

# iterare sulle righe

In [36]:
for i in shop.index:
    el = shop.loc[i]
    print(el['frutta'], el['qta'])

mele 10
pere 20
kiwi 30
banane 100
pomodori 123

In [38]:
for indice, valori in shop.iterrows():
    print(indice, valori.frutta, valori.qta)

1 mele 10
2 pere 20
3 kiwi 30
9 banane 100
20 pomodori 123